docs/notes/terraform.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Terraform</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Terraform</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2619750">Kinds of terraform files</a></li>
<li><a href="#orgf67fc5a">State</a>
<ul>
<li><a href="#org0fcc22b">terraform state list</a></li>
<li><a href="#org6d9a174">Get state details</a></li>
</ul>
</li>
<li><a href="#orgf10cdee">Workspaces</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org2619750" class="outline-2">
<h2 id="org2619750"><a href="#org2619750">Kinds of terraform files</a></h2>
<div class="outline-text-2" id="text-org2619750">
<ul class="org-ul">
<li>state files (terraform.tfstate)</li>
<li>configs (.tf)</li>
<li>plans (.tfplan)</li>
<li>variables file (.tfvars)</li>
</ul>
</div>
</div>

<div id="outline-container-orgf67fc5a" class="outline-2">
<h2 id="orgf67fc5a"><a href="#orgf67fc5a">State</a></h2>
<div class="outline-text-2" id="text-orgf67fc5a">
<p>
After a <code>terraform apply</code>, Terraform refreshes the local <code>terraform.tfstate</code>
file.
</p>

<p>
<code>terraform plan</code> refreshes local state first, but only in-memory.
</p>
</div>

<div id="outline-container-org0fcc22b" class="outline-3">
<h3 id="org0fcc22b"><a href="#org0fcc22b">terraform state list</a></h3>
<div class="outline-text-3" id="text-org0fcc22b">
<p>
A brief list of all objects in the current state.
</p>

<div class="org-src-container">
<pre class="src src-sh">terraform state list
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d9a174" class="outline-3">
<h3 id="org6d9a174"><a href="#org6d9a174">Get state details</a></h3>
<div class="outline-text-3" id="text-org6d9a174">
<p>
There are two ways:
</p>

<ul class="org-ul">
<li><code>terraform show</code></li>
<li><code>terraform state show</code></li>
</ul>

<p>
<code>terraform state show</code> is a lot more brief, and doesn't have the option to
show JSON output.
</p>

<p>
<code>terraform show -json</code> dumps everything, and then you can dig into it with
<code>jq</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf10cdee" class="outline-2">
<h2 id="orgf10cdee"><a href="#orgf10cdee">Workspaces</a></h2>
<div class="outline-text-2" id="text-orgf10cdee">
<p>
A workspace has
</p>

<ul class="org-ul">
<li>Terraform config (HCL files)</li>
<li>Values for variables used by the config</li>
<li>Terraform state</li>
<li>Historical state and run logs</li>
</ul>
</div>
</div>
</div>
</body>
</html>
